games = {
    "1": {
        "key": "ewadsdy",
        "output": 24100880867,
        "hint1":"เลขถัดไปคือผลรวมของตัวก่อนหน้ารวมกับตัวปัจจุบัน",
        "hint2":"เครื่องจักรจะคำนวณผลรวมของตัวเลขสองตัว แล้วตัดสินใจว่าจะลบ1ถ้าเป็นเลขคู่ hint ถัดไปจะเป็นเฉลย",
        "hint3":"24100880867"
    },
    "2": {
        "key": "fshtsjl",
        "output": "CODEMASTER",
        "hint1":"ไม่ใช่ทุกตัวอักษรในข้อความที่มีประโยชน์ — มองหาตัวพิมพ์ใหญ่เท่านั้น",
        "hint2":"ให้ลองวนลูปผ่านแต่ละตัวอักษรในข้อความ แล้วเช็คว่า .isupper()",
        "hint3":"นี่ไม่ใช่รหัสลับแปลก ๆ มันคือการเลือกเฉพาะบางตัวอักษรตามรูปแบบที่มองเห็นได้ง่าย"
    },
    "3": {
        "key": "ยังไม่มีข้อต่อไป5555",
        "output": "TOPSOSMARTANDCOOL",
        "hint1":"ลองใช้ chr() เพื่อแปลงเลขเป็นตัวอักษร",
        "hint2":"ใน ASCII, ตัวอักษร A-Z มีค่าระหว่าง 65 ถึง 90",
        "hint3":"ตัวเลขที่ไม่เข้าเกณฑ์ ให้ข้ามไปเลย"
    }
}
